# Ex3 - Getting and Knowing your Data

This time we are going to pull data directly from the internet.
Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called df_users and use the 'user_id' as index

In [2]:
url = "https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user"
df_users = pd.read_csv(url, sep= "|")

### Step 4. See the first 25 entries

In [6]:
df_users.iloc[:10]

   user_id  age gender     occupation zip_code
0        1   24      M     technician    85711
1        2   53      F          other    94043
2        3   23      M         writer    32067
3        4   24      M     technician    43537
4        5   33      F          other    15213
5        6   42      M      executive    98101
6        7   57      M  administrator    91344
7        8   36      M  administrator    05201
8        9   29      M        student    01002
9       10   53      M         lawyer    90703

In [7]:
df_users.iloc[:10, :2]

   user_id  age
0        1   24
1        2   53
2        3   23
3        4   24
4        5   33
5        6   42
6        7   57
7        8   36
8        9   29
9       10   53

In [9]:
df_users.iloc[:10, 2:4]

  gender     occupation
0      M     technician
1      F          other
2      M         writer
3      M     technician
4      F          other
5      M      executive
6      M  administrator
7      M  administrator
8      M        student
9      M         lawyer

In [10]:
df_users.iloc[3:10, 2:4]

  gender     occupation
3      M     technician
4      F          other
5      M      executive
6      M  administrator
7      M  administrator
8      M        student
9      M         lawyer

In [11]:
df_users.iloc[3:10, 2:4] = 'Julio Iglesias'

In [12]:
df_users

     user_id  age          gender      occupation zip_code
0          1   24               M      technician    85711
1          2   53               F           other    94043
2          3   23               M          writer    32067
3          4   24  Julio Iglesias  Julio Iglesias    43537
4          5   33  Julio Iglesias  Julio Iglesias    15213
..       ...  ...             ...             ...      ...
938      939   26               F         student    33319
939      940   32               M   administrator    02215
940      941   20               M         student    97229
941      942   48               F       librarian    78209
942      943   22               M         student    77841

[943 rows x 5 columns]

In [8]:
df_users.iloc[:10, 2:]

  gender     occupation zip_code
0      M     technician    85711
1      F          other    94043
2      M         writer    32067
3      M     technician    43537
4      F          other    15213
5      M      executive    98101
6      M  administrator    91344
7      M  administrator    05201
8      M        student    01002
9      M         lawyer    90703

In [5]:
df_users.iloc[-10:,:]

     user_id  age gender     occupation zip_code
933      934   61      M       engineer    22902
934      935   42      M         doctor    66221
935      936   24      M          other    32789
936      937   48      M       educator    98072
937      938   38      F     technician    55038
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

In [4]:
df_users.iloc[:25,:]

    user_id  age gender     occupation zip_code
0         1   24      M     technician    85711
1         2   53      F          other    94043
2         3   23      M         writer    32067
3         4   24      M     technician    43537
4         5   33      F          other    15213
5         6   42      M      executive    98101
6         7   57      M  administrator    91344
7         8   36      M  administrator    05201
8         9   29      M        student    01002
9        10   53      M         lawyer    90703
10       11   39      F          other    30329
11       12   28      F          other    06405
12       13   47      M       educator    29206
13       14   45      M      scientist    55106
14       15   49      F       educator    97301
15       16   21      M  entertainment    10309
16       17   30      M     programmer    06355
17       18   35      F          other    37212
18       19   40      M      librarian    02138
19       20   42      F      homemaker    95660
20       21   26      M         writer    30068
21       22   25      M         writer    40206
22       23   30      F         artist    48197
23       24   21      F         artist    94533
24       25   39      M       engineer    55107

In [78]:
df_users.head(25)

    user_id  age gender     occupation zip_code
0         1   24      M     technician    85711
1         2   53      F          other    94043
2         3   23      M         writer    32067
3         4   24      M     technician    43537
4         5   33      F          other    15213
5         6   42      M      executive    98101
6         7   57      M  administrator    91344
7         8   36      M  administrator    05201
8         9   29      M        student    01002
9        10   53      M         lawyer    90703
10       11   39      F          other    30329
11       12   28      F          other    06405
12       13   47      M       educator    29206
13       14   45      M      scientist    55106
14       15   49      F       educator    97301
15       16   21      M  entertainment    10309
16       17   30      M     programmer    06355
17       18   35      F          other    37212
18       19   40      M      librarian    02138
19       20   42      F      homemaker    95660
20       21   26      M         writer    30068
21       22   25      M         writer    40206
22       23   30      F         artist    48197
23       24   21      F         artist    94533
24       25   39      M       engineer    55107

### Step 5. See the last 10 entries

In [13]:
df_users.tail(10)

     user_id  age gender     occupation zip_code
933      934   61      M       engineer    22902
934      935   42      M         doctor    66221
935      936   24      M          other    32789
936      937   48      M       educator    98072
937      938   38      F     technician    55038
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

In [18]:
url = "https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user"
df_users = pd.read_csv(url, sep= "|")

In [20]:
df_users.index

RangeIndex(start=0, stop=943, step=1)

In [23]:
df_users = df_users.set_index('user_id')

In [25]:
df_users.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

In [24]:
df_users

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

In [27]:
df_users.loc[:2,:]

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043

In [26]:
df_users.loc[0,:]

KeyError: 0

### Step 6. What is the number of observations in the dataset?

In [28]:
df_users.shape[0]

943

### Step 7. What is the number of columns in the dataset?

In [29]:
df_users.shape[1]

4

### Step 8. Print the name of all the columns.

In [30]:
df_users.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

### Step 9. How is the dataset indexed?

cada fila es un usuario

In [31]:
df_users.index ##Â lo he mirado, no sabÃ­a bien que me preguntaba

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

In [32]:
df_users

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

### Step 10. What is the data type of each column?

In [34]:
type(df_users)

pandas.core.frame.DataFrame

In [ ]:
df_users.type

In [33]:
df_users.dtypes ## Lo he mirado, probÃ© type() con error

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### Step 11. Print only the occupation column

In [35]:
df_users.occupation

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

### Step 12. How many different occupations are in this dataset?

In [36]:
len(set(df_users.occupation)) # NO mirÃ©

21

In [37]:
df_users.occupation.nunique() # MirÃ©

21

In [40]:
df_users.occupation.unique()

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)

In [41]:
df_users.occupation.nunique()

21

### Step 13. What is the most frequent occupation?

In [42]:
df_users.groupby('occupation')

In [43]:
df_users.groupby('occupation').sum()

                age
occupation
administrator  3061
artist          879
doctor          305
educator       3991
engineer       2438
entertainment   526
executive      1239
healthcare      665
homemaker       228
lawyer          441
librarian      2040
marketing       978
none            239
other          3625
programmer     2186
retired         883
salesman        428
scientist      1102
student        4328
technician      895
writer         1634

In [44]:
df_users.groupby('occupation').size()

occupation
administrator     79
artist            28
doctor             7
educator          95
engineer          67
entertainment     18
executive         32
healthcare        16
homemaker          7
lawyer            12
librarian         51
marketing         26
none               9
other            105
programmer        66
retired           14
salesman          12
scientist         31
student          196
technician        27
writer            45
dtype: int64

In [38]:
#. df_users.groupby(by="occupation").sum() # value_counts() Iba a crear una columna de uno en el df para contarlos con el gruopby

df_users.occupation.value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

### Step 14. Summarize the DataFrame.

In [57]:
df_users.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

### Step 15. Summarize all the columns

In [62]:
df_users.describe(include="all")

           user_id         age gender occupation zip_code
count   943.000000  943.000000    943        943      943
unique         NaN         NaN      2         21      795
top            NaN         NaN      M    student    55414
freq           NaN         NaN    670        196        9
mean    472.000000   34.051962    NaN        NaN      NaN
std     272.364951   12.192740    NaN        NaN      NaN
min       1.000000    7.000000    NaN        NaN      NaN
25%     236.500000   25.000000    NaN        NaN      NaN
50%     472.000000   31.000000    NaN        NaN      NaN
75%     707.500000   43.000000    NaN        NaN      NaN
max     943.000000   73.000000    NaN        NaN      NaN

### Step 16. Summarize only the occupation column

In [63]:
df_users.occupation.describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

### Step 17. What is the mean age of df_users?

In [66]:
round(df_users.age.mean())

34

### Step 18. What is the age with least occurrence?

In [74]:
df_users.age.value_counts().tail(5)

7     1
66    1
11    1
10    1
73    1
Name: age, dtype: int64